{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "mvt_vrl_model",
      "trainable": true,
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_1",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "batch_input_shape": [
              null,
              200
            ]
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "bn_1",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_1",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.2
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_2",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "name": "bn_2",
            "trainable": true,
            "dtype": "float32",
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true
          }
        },
        {
          "class_name": "Dropout",
          "config": {
            "name": "dropout_2",
            "trainable": true,
            "dtype": "float32",
            "rate": 0.15
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "dense_3",
            "trainable": true,
            "dtype": "float32",
            "units": 32,
            "activation": "relu",
            "use_bias": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "name": "output",
            "trainable": true,
            "dtype": "float32",
            "units": 3,
            "activation": "softmax",
            "use_bias": true
          }
        }
      ]
    },
    "keras_version": "2.15.0",
    "backend": "tensorflow"
  },
  "format": "layers-model",
  "generatedBy": "MVT-VRL Trainer v2.0",
  "convertedBy": "train_model.py"
}